Revit 2027 API
CitySet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CitySetIterator ReverseIterator()
Public Overridable Function ReverseIterator As CitySetIterator
public:
virtual CitySetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> CitySetIterator
override ReverseIterator : unit -> CitySetIterator
Return Value
CitySetIterator
Returns a backward moving iterator to the set.
See Also
Reference
CitySet Class
Autodesk.Revit.DB Namespace